scripts/lsc-stress-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="LSC 系统压力测试计划" enabled="true">
      <stringProp name="TestPlan.comments">LSC V6.2-AI 全链路压测 - 覆盖订单、账本、推广、风控、B2B、对账等核心场景</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <stringProp name="TestPlan.user_defined_variables">
        [
          {"name":"base_url","value":"http://localhost:8080","description":"LSC网关基础URL"},
          {"name":"concurrent_users","value":"200","description":"并发用户数"},
          {"name":"ramp_up_seconds","value":"30","description":"爬坡时间(秒)"},
          {"name":"hold_time_seconds","value":"120","description":"持续压测时间(秒)"},
          {"name":"order_rps","value":"50","description":"订单目标RPS"},
          {"name":"ledger_rps","value":"100","description":"账本目标RPS"},
          {"name":"promotion_rps","value":"30","description":"推广目标RPS"},
          {"name":"b2b_rps","value":"10","description":"B2B目标RPS"},
          {"name":"think_time_ms","value":"100","description":"请求间隔(ms)"}
        ]
      </stringProp>
    </TestPlan>
    <hashTree>
      <!-- 全局配置 -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 请求默认值" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${base_url}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP 头管理器" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Header.header.1" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="Header.header.2" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- 场景1: 用户登录与认证 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景1: 用户登录与认证" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <boolProp name="LoopController.reset_on_thread">true</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/user/login - 用户登录" enabled="true">
          <stringProp name="HTTPSampler.path">/api/user/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.argument">account=test_${__threadNum}@lsc.com</stringProp>
          <stringProp name="HTTPSampler.argument">password=test123456</stringProp>
          <stringProp name="HTTPSampler.argument">userType=0</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="断言: 登录成功(HTTP 200)" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="断言: 返回Token" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">"data":</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="提取Token" enabled="true">
            <stringProp name="cacheKey">extract_token</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
              def json = new groovy.json.JsonSampler().parse(sampler.prevResult.getResponseDataAsString())
              vars.put("auth_token", json.data?.token ?: "")
              return "Token: " + vars.get("auth_token").substring(0, Math.min(20, vars.get("auth_token").length())) + "..."
            </stringProp>
          </JSR223Sampler>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/user/info - 获取用户信息" enabled="true">
          <stringProp name="HTTPSampler.path">/api/user/info</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.header_manager">token;${auth_token}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- 场景2: 订单创建与支付 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景2: 订单创建与混合支付" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">80</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/order/create - 创建订单" enabled="true">
          <stringProp name="HTTPSampler.path">/api/order/create</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}|merchantName=测试商家_${__threadNum}|totalAmount=${__Random(10,500)}|lscAmount=${__Random(0,50)}|description=测试订单</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="断言: 订单创建成功" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/ledger/deduct - LSC扣减" enabled="true">
          <stringProp name="HTTPSampler.path">/api/ledger/deduct</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}|amount=${__Random(0,30)}|orderNo=${order_no}</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/order/pay - 订单支付" enabled="true">
          <stringProp name="HTTPSampler.path">/api/order/pay</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">orderNo=${order_no}|channel=WECHAT|rmbAmount=${__Random(10,200)}</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/writeoff/apply - 核销申请" enabled="true">
          <stringProp name="HTTPSampler.path">/api/writeoff/apply</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">orderNo=${order_no}|userId=${__threadNum}</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- 场景3: B2B订单流程 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景3: B2B订单全流程" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/b2b/order/create - 创建B2B订单" enabled="true">
          <stringProp name="HTTPSampler.path">/api/b2b/order/create</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">initiatorId=${__threadNum}|counterpartyId=${__MathJS(${__threadNum}+100)}|totalAmount=${__Random(1000,100000)}|lscAmount=${__Random(500,50000)}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/b2b/order/confirm - 确认B2B订单" enabled="true">
          <stringProp name="HTTPSampler.path">/api/b2b/order/confirm</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">orderNo=${b2b_order_no}|confirmerId=${__MathJS(${__threadNum}+100)}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/b2b/order/execute - 执行B2B流转" enabled="true">
          <stringProp name="HTTPSampler.path">/api/b2b/order/execute</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">orderNo=${b2b_order_no}|operatorId=${__threadNum}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- 场景4: 商品与推广 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景4: 商品查询与推广领取" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/mall/products - 商品列表" enabled="true">
          <stringProp name="HTTPSampler.path">/api/mall/products</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.arguments">page=1|size=20|status=1</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/promotion/check-first - 首单判定" enabled="true">
          <stringProp name="HTTPSampler.path">/api/promotion/check-first</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/ledger/balance - 查询余额" enabled="true">
          <stringProp name="HTTPSampler.path">/api/ledger/balance</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- 场景5: 风控检测 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景5: 风控检测与AI调用" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">30</stringProp>
        <stringProp name="ThreadGroup.ramp_time">15</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/risk/check-batch - 批量风控检测" enabled="true">
          <stringProp name="HTTPSampler.path">/api/risk/check-batch</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}|orderCount=${__Random(1,10)}|windowMinutes=1</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/risk/ai-check - AI风控评估" enabled="true">
          <stringProp name="HTTPSampler.path">/api/risk/ai-check</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}|orderAmount=${__Random(50,5000)}|paymentChannel=WECHAT</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/risk/limit-check - 限流检查" enabled="true">
          <stringProp name="HTTPSampler.path">/api/risk/limit-check</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.arguments">userId=${__threadNum}|action=ORDER_CREATE</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- 场景6: 存证与上链 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景6: 存证哈希与上链" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">15</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/evidence/hash - 提交哈希存证" enabled="true">
          <stringProp name="HTTPSampler.path">/api/evidence/hash</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">hash=sha256:${__UUID}|bizType=ORDER|bizId=${__threadNum}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/evidence/merkle - Merkle树根计算" enabled="true">
          <stringProp name="HTTPSampler.path">/api/evidence/merkle</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">hashes=sha256:h1,sha256:h2,sha256:h3,sha256:h4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/evidence/chain - 上链存证" enabled="true">
          <stringProp name="HTTPSampler.path">/api/evidence/chain</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <stringProp name="HTTPSampler.arguments">rootHash=0x${__UUID}|bizType=RECONCILE</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>

      <!-- 响应时间断言 -->
      <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="全局: 响应时间<3s" enabled="true">
        <collectionProp name="Asserion.test_strings">
          <stringProp name="49586">3000</stringProp>
        </collectionProp>
        <stringProp name="Assertion.test_field">Assertion.response_time</stringProp>
        <intProp name="Assertion.test_type">8</intProp>
      </ResponseAssertion>
      <hashTree/>

      <!-- 结果统计 -->
      <ResultCollector guiclass="StatVisualizer" testclass="StatVisualizer" testname="聚合报告" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <!-- JSR223 后处理: 生成压测报告 -->
      <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="生成压测报告摘要" enabled="true">
        <stringProp name="scriptLanguage">groovy</stringProp>
        <stringProp name="script">
          def stats = prev.sampler.parent.getVariables().get('JMeterService')
          log.info("=== LSC 压测完成 ===")
          log.info("场景数: 6")
          log.info("总线程数: " + (50+80+20+100+30+15))
          log.info("建议: 目标RPS: 500+, P99响应时间<3s")
          return "压测完成，详见聚合报告"
        </stringProp>
      </JSR223Sampler>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>